import React, { Component } from 'react'
import Layout from './LayoutComponent'
import { Jumbotron, Container, Media } from 'reactstrap';
export default class AboutComponent extends Component {
  render() {
    const imgStyle = {
      maxHeight: 450,
      maxWidth: 350,
      paddingRight: 30
    }
    return (
      <Layout container="container-fluid" >
        
        <Jumbotron fluid>
          <Container >
            <Media>
              <Media left href="#">
                <Media object src="https://c0.dq1.me/uploads/article/3819/user-1823160-2017-03-17-11-05-08.jpg" alt="image1"  style={imgStyle}/>
              </Media>
              <Media body>
                <Media heading>
                  เทคนิคจัดสรรเวลาอย่างมืออาชีพ
                </Media>
                  ใช้เวลา 30 นาทีแรกของวันเพื่อวางแผน และอย่าเริ่มต้นวันใหม่จนกว่าทุกอย่างจะเสร็จสิ้น 
                  แน่นอนว่าบางครั้งอาจมีอะไรมาขัดจังหวะ แนะนำให้ดึงตัวเองกลับมาให้เร็วที่สุด ช่วงเวลาที่สำคัญที่สุดคือขั้นตอนนี้แหละ!
                  ทำตามกำหนดการที่วางไว้ และจดบันทึกทุกอย่างแบบละเอียดเป็นเวลา 1 สัปดาห์ วิธีนี้จะช่วยให้คุณเข้าใจว่าแต่ละวันคุณทำอะไร 
                  และใช้เวลาเท่าไหร่ ซึ่งจะทำให้คุณรู้ตัวว่าเสียเวลาเปล่าประโยชน์ไปกับอะไรบ้าง
                  จัดลำดับความสำคัญ โดยกำหนดเวลาที่แน่ชัดให้กิจกรรมหรือนัดหมายสำคัญ ๆ ตั้งแต่ต้นจนจบ และทำตามเคร่งครัด 
                  จากนั้นให้ใช้เวลาอย่างน้อย 50% ไปกับกิจกรรมที่สำคัญที่สุด
              </Media>
            </Media>
          </Container>
        </Jumbotron>

        <Jumbotron fluid>
          <Container >
            <Media>
              <Media left href="#">
                <Media object src="https://th.jobsdb.com/th-th/wp-content/uploads/sites/3/2018/06/%E0%B9%80%E0%B8%84%E0%B8%A5%E0%B9%87%E0%B8%94%E0%B8%A5%E0%B8%B1%E0%B8%9A%E0%B8%9D%E0%B8%B6%E0%B8%81%E0%B8%87%E0%B8%B2%E0%B8%99%E0%B9%83%E0%B8%AB%E0%B9%89%E0%B8%A1%E0%B8%B1%E0%B8%94%E0%B9%83%E0%B8%88.png" alt="image2" style={imgStyle} />
              </Media>
              <Media body>
                <Media heading>
                  ฝึกงานสายดีไซน์อย่างไร ให้กลายเป็นมืออาชีพในอนาคต
                </Media>
                  คุณควรทำทุกงานอย่างเต็มที่  เพื่อให้ผลงานโดดเด่นเข้าตากรรมการ
                  ให้ความเคารพซึ่งกันและกัน จะช่วยให้บรรยากาศในทีมดีขึ้น จงเรียนรู้ที่จะสื่อสารและรักษาความสัมพันธ์กับทีม  เพราะนอกจากความรับผิดชอบ 
                  นี่คือส่วนหนึ่งในการตัดสินใจรับเข้าทีม ไม่มีใครหวังให้คุณรู้ทุกอย่างอยู่แล้ว สิ่งสำคัญคือการเปิดใจเรียนรู้ และพัฒนา หากมีสิ่งที่ไม่ทราบ 
                  ก็แค่ขอคำแนะนำจากรุ่นพี่ ที่สำคัญอย่าลืมถามผู้อื่นเสมอว่า มีอะไรให้ช่วยไหม งานออกแบบไม่จำเป็นต้องทำในที่เงียบ ๆ เสมอไป 
                  การเป็นคนมีอารมณ์ขัน จะช่วยให้คุณทำงานอย่างมีความสุข
                  สิ่งสำคัญที่เอเจนซี่ชั้นนำบอกคือ คุณต้องหัวเราะในที่ทำงาน! และอีกอย่างคือ เครื่องดื่มดี ๆ ก็จำเป็นไม่แพ้กัน
              </Media>
            </Media>
          </Container>
        </Jumbotron>

        <Jumbotron fluid>
          <Container >
            <Media>
              <Media left href="#">
              <Media object src="https://hcm-jinjer.com/thai-media/wp/wp-content/uploads/2019/03/shutterstock_668007496.png" alt="image3" style={imgStyle} />
              </Media>
              <Media body>
                <Media heading>
                  วิธีการเลื่อนสัมภาษณ์งานอย่างมืออาชีพ
                </Media>
                  ในกรณีนี้ไม่ว่าจะมีธุระจริงหรือไม่ก็ตาม คุณจะต้องแจ้งกับทางบริษัทที่จะไปสัมภาษณ์งานให้เร็วที่สุดว่าคุณไม่มาสามารถไปตามเวลาที่นัดหมายไว้ได้ 
                  ซึ่งทางที่ดีคุณควรจะแจ้งแก่ทางบริษัทให้เร็วที่สุดทันทีที่คุณรู้ตัวว่าไม่สามารถไปสัมภาษณ์งานได้ เนื่องจากการสัมภาษณ์งานครั้งหนึ่งนั้นบริษัทจะต้องเตรียมทั้งเอกสาร 
                  แจ้งแก่ผู้มีหน้าที่สัมภาษณ์และยังต้องมีขั้นตอนต่างๆ ที่ใช้เวลามากมายอีก การบอกกล่าวแก่ HR ว่าไม่สามารถไปสัมภาษณ์ได้ยังช่วยทำให้ไม่เสียความสัมพันธ์กับทางบริษัทด้วย
                  เผื่อว่าอนาคตจะมีตำแหน่งงานเปิดใหม่แล้วคุณสนใจจะได้ไม่เสียโอกาสในการทำงานไป
              </Media>
            </Media>
          </Container>
        </Jumbotron>

        <Jumbotron fluid>
          <Container >
            <Media>
              <Media left href="#">
              <Media object src="https://assets.rappler.com/D11E15E63CE348C49135BA702A09159F/img/97FC8E3FBA4840D481A25185F30D965B/job-offer-20160202.jpg" alt="image4" style={imgStyle} />
              </Media>
              <Media body>
                <Media heading>
                  ต้องดูอะไรบ้างก่อนตกลงเข้าทำงาน
                </Media>
                ตำแหน่งงานและรายละเอียดงานเป็นสิ่งที่สำคัญที่สุดเมื่อตอบรับเข้าทำงานแล้ว 
                จะต้องอ่านให้ละเอียดถี่ถ้วนเพราะจะมีผลโดยตรงต่อการทำงานในอนาคต 
                ไม่ว่าจะทำงานตำแหน่งใหม่หรือเป็นตำแหน่งเดิมในที่ใหม่ก็ตาม 
                คุณก็ต้องเข้าใจว่าที่ทำงานแต่ละที่มีปัจจัยหลายอย่างไม่เหมือนกัน
                 ดังนั้นขอบเขตการทำงานก็ไม่เหมือนกันตามไปด้วย ถ้าไม่ตกลงกันให้ดี 
                 การทำงานของคุณอาจจะกลายเป็นเรื่องลำบากเพราะว่าคุณจะต้องทำงานมากมายที่อยู่นอกเหนือความรับผิดชอบของคุณ
                  ซึ่งจะทำให้การทำงานประจำไม่มีประสิทธิภาพแล้วงานรองก็อาจจะมากงานหลักอีกด้วย
              </Media>
            </Media>
          </Container>
        </Jumbotron>

      </Layout>
    )
  }
}
